In [1]:
import pandas as pd

In [2]:
account_info = pd.DataFrame({
    'name': ['Bob', 'Mary', 'Mita'],
    'account': [123846, 123972, 347209],
    'balance': [123, 3972, 7209]
})

In [3]:
account_info['name']

0     Bob
1    Mary
2    Mita
Name: name, dtype: object

In [4]:
account_info['name'] = ['Smith', 'Jane', 'Patel']

In [5]:
account_info

    name  account  balance
0  Smith   123846      123
1   Jane   123972     3972
2  Patel   347209     7209